Repository: iinteractive/moose-website
Catalog: lib/Moose/Website/I18N/po/*.po
Languages: nb

source: header moose
nb: Moose

source: header moose subtitle
nb: Et Postmoderne Objekt System for Perl

source: moose page title
nb: Moose - Et Postmoderne Object System for Perl

source: nav home
nb: Hjem

source: nav blog
nb: Blogg

source: nav about
nb: Om

source: nav articles
nb: Artikler

source: nav download
nb: Nedlast

source: nav support
nb: Kundestøtte

source: nav presentations
nb: Presentasjoner

source: home body
nb: <p>Moose er et <a href='http://www.perl.com/pub/a/1999/03/pm.html'>postmoderne objektsystem</a> for Perl 5 som tar det kjedelige ut av å skrive objekt-orientert Perl. Det låner alle de beste funksjonene fra Perl 6, <acronym title='Common Lisp Object System'>CLOS</acronym> (Lisp), Smalltalk, Java, BETA, OCaml, Ruby og mer, mens det fortsatt er trofast mot dets Perl 5-røtter</p><p>Moose er 100% produksjonsklar og i tung bruk i en rekke systemer og vokser hver dag. <a href='http://search.cpan.org/dist/Moose'>Prøv det i dag!</a></p>

source: about body
nb: <p>Moose er en forlengelse av Perl 5 objekt systemet. Hovedmålet med Moose er å gjøre Perl 5 objektorientert programmering enklere, mer konsekvent og mindre kjedelig. Med Moose kan du tenke mer på hva du vil gjøre og mindre på mekanikken om<acronym title='object-oriented programming'>OOP</acronym>.</p><p><a href='#code_sample' rel='facebox'>Moose code sample</a></p>

source: about new to moose header
nb: Ny med Moose?

source: about new to moose body
nb: <p>Hvis du er ny med Moose, er det bedste sted å starte<a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual.pod'><code>Moose::Manual</code></a> dokumenter, fulgt av<a href='http://search.cpan.org/dist/Moose/lib/Moose/Cookbook.pod'><code>Moose::Cookbook</code></a>. Introduksjonen vil vise deg hva Moose er, og hvordan det gjør Perl 5<acronym title='object orientation'>OO</acronym> bedre.</p><p>Kokebøkenes oppskrifter på Moose grunnleggende, vil få deg opp til hastigheten med mange av Moose funksjoner raskt. Når du har en idé om hva Moose kan gjøre, kan du bruke <acronym title='application programming interface'>API</acronym> dokumentasjon for å få flere detaljer om funksjoner som interesserer deg.</p><p>Moose er også omtalt fremtredende i et par bøker:</p><ul><li><a href='http://www.onyxneon.com/books/modern_perl/index.html'>Modern Perl</a></li><li><a href='http://apress.com/book/view/1430223650'>The Definitive Guide to Catalyst</a></li><li><a href='http://perlmoderne.fr/'>Perl Moderne</a></li></ul>

source: about organization list header
nb: Organisasjoner som bruker Moose

source: about organization list body
nb: <p>Moose er brukt av et stort antall organisasjoner rundt om i verden, noen av dem er:</p>

source: download body
nb: <p>Moose og dens tilhørende moduler er tilgjengelige for nedlasting fra<acronym title='Comprehensive Perl Archive Network'>CPAN</acronym>, Perls verdensomspennende speilet modul distribusjon plattform. Moose er også<a href='http://cpants.perl.org/dist/used_by/Moose'>brukt av andre<acronym title='Comprehensive Perl Archive Network'>CPAN</acronym>moduler</a>.</p>

source: download info Moose
nb: Kjerne distribusjon av Moose

source: download info <code>Task::Moose</code>
nb: En samling av gode Moose utvidelser

source: download info <code>Task::Kensho</code>
nb: En samling av gode Moderne Perl-moduler

source: download info <code>MooseX::*</code>
nb: Moose utvidelsene

source: download git header
nb: Git

source: download git body
nb: <p>Moose er utviklet ved hjelp av<a href='http://git-scm.com/'>Git source control system</a>. Moose er et veldig åpent prosjekt og vi er alltid villige til å ta bidrag fra andre. <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Contributing.pod'><code>Moose::Manual::Contributing</code></a> beskriver våre spesifikke bidrags retningslinjer og forteller deg hvordan du kommer i gang med vårt arbeid-flow.</p><p><a href='http://search.cpan.org/~apocal/'>Apocalypse</a>visualiserte<a href='http://www.youtube.com/watch?v=Gwq10W0RaHQ&amp;hd=1'>aktiviteten i Git repositories av Moose</a> and <a href='http://www.youtube.com/watch?v=HlJDnvNSfJo&amp;hd=1'><code>Class::MOP</code></a>i anledning av deres 1.0 utgivelse. Disse visualiseringer ble skapt med<a href='http://code.google.com/p/gource/wiki/Videos'>Gource</a>.</p>

source: download git public
nb: Git Offentlig Database URL

source: download git committer
nb: Git URL til Committers

source: download git web view
nb: Git webvisning

source: download github mirror
nb: GitHub Speil

source: support body
nb: <p>Moose er et fellesskap drevet prosjekt, og du kan finne hjelp og støtte på de offisielle<acronym title='Internet relay chat'>IRC</acronym> kanaler og e-postlister, men også på community basert hjelpesystem nettsteder som <a href='http://www.perlmonks.org'>PerlMonks</a> and <a href='http://www.stackoverflow.com'>Stack Overflow</a>. Du kan også referere til den offisielle <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Support.pod'><code>Moose::Manual::Support</code></a> dokumentasjonen for mer detalje.</p>

source: support irc header
nb: <acronym title='Internet relay chat'>IRC</acronym> Kanaler

source: support irc body
nb: <p>Den raskeste måte å få Moose støtte er å engasjere fellesskapet på <acronym title='Internet relay chat'>IRC</acronym>.</p>

source: support mailing list header
nb: Mailingliste

source: support mailing list body
nb: <p>Moose postlisterne kan være en utmerket måte å få svar på spørsmål.</p>

source: support misc header
nb: Diverse

source: support misc body
nb: <p>Du kan muligens liker et par andre elementer som er nyttige.</p>

source: support moose mailing list
nb: Moose mailingliste

source: support moose mailing list archives
nb: Moose mailingliste arkiv

source: support textmate bundle
nb: Moose TextMate Pakke

source: support quickref card
nb: Moose Hurtigreferansekort

source: articles body
nb: <p>Mange interessante og nyttige artikler og blogginnlegg er skrevet om Moose. <a href='http://ironman.enlightenedperl.org/'>Perl Iron Man blog</a> har ganske ofte Moose relaterte innlegg..</p><p>Hvis du kjenner til en artikkel eller blogginnlegg som du synes bør være med, <a href='support.html'>gi oss beskjed gjennom <acronym title='Internet relay chat'>IRC</acronym> eller mailinglisten</a> og vi vil legge den inn her.</p>

source: presentations body
nb: <p>Moose brukere gi presentasjoner på konferanser og lokale Perl Mongers gruppemøter.</p><p>Hvis du kjenner til en presentasjon som du mener bør inkluderes, <a href='support.html'>gi oss beskjed gjennom <acronym title='Internet relay chat'>IRC</acronym> eller mailinglisten</a> og vi vil legge den inn her.</p>

source: presentations video label
nb: video

source: presentations podcast label
nb: podcast

source: presentations Perl Mongers Groups
nb: Perl Mongers Grupper

source: footer copyright
nb: Copyright © <a href='http://www.iinteractive.com'>Infinity Interactive</a>, 2006 - 2011

source: footer terms
nb: Dette biblioteket er fri software, du kan redistribuere det og/eller modifisere det under de samme vilkår som Perl selv.
